CricDummy/app/controllers/formats_controller.rb

SELECT "formats".* FROM "formats"
---
def index
  @players=Format.all

INSERT INTO "formats" ("formatName", "numberOfOvers", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "formatID"
---
def create
  @format = Format.new(format_params)
  if @format.save

UPDATE "formats" SET "description" = $1, "updated_at" = $2 WHERE "formats"."formatID" = $3  [["description", "Twenty20 International is the shortest format of cricket with each team allowed to play 20 overs"], ["updated_at", "2023-11-06 12:09:13.404739"], ["formatID", 1]]
---
def update
  if @format.update(format_params)

SELECT "formats".* FROM "formats" WHERE "formats"."formatID" = $1 LIMIT $2  [["formatID", 3], ["LIMIT", 1]]
---
def set_format
  @format = Format.find(params[:id])