CricDummy/app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches"
SELECT "players".* FROM "players" WHERE "players"."playerID" IN ($1, $2, $3, $4, $5)  [["playerID", 6], ["playerID", 9], ["playerID", 12], ["playerID", 10], ["playerID", 3]]
SELECT "referees".* FROM "referees" WHERE "referees"."refereeID" IN ($1, $2, $3, $4, $5, $6, $7)  [["refereeID", 3], ["refereeID", 4], ["refereeID", 7], ["refereeID", 10], ["refereeID", 9], ["refereeID", 8], ["refereeID", 11]]
SELECT "teams".* FROM "teams" WHERE "teams"."teamID" IN ($1, $2, $3, $4, $5, $6, $7, $8)  [["teamID", 1], ["teamID", 3], ["teamID", 5], ["teamID", 7], ["teamID", 9], ["teamID", 10], ["teamID", 12], ["teamID", 14]]
---
  def index
    @matches = Match.includes(:tournament, :team1, :team2, :winning_team, :referee, :venue, :pom_player).all

INSERT INTO "matches" ("tourID", "matchStatus", "matchDateTime", "result", "team1ID", "team2ID", "winningTeamID", "refereeID", "venueID", "pom_playerID", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "matchID", "matchDateTime"
---
  def create
    @match = Match.new(match_params)

    if @match.save

UPDATE "matches" SET "team2ID" = $1, "updated_at" = $2 WHERE "matches"."matchID" = $3  [["team2ID", 4], ["updated_at", "2023-11-07 10:00:18.898979"], ["matchID", 2]]
---
  def update
    if @match.update(match_params)

DELETE FROM "matches" WHERE "matches"."matchID" = $1  [["matchID", 11]]
---
  def destroy
    @match.destroy

SELECT "matches".* FROM "matches" WHERE "matches"."matchID" = $1 LIMIT $2  [["matchID", 1], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."playerID" = $1  [["playerID", 3]]
SELECT "referees".* FROM "referees" WHERE "referees"."refereeID" = $1  [["refereeID", 3]]
SELECT "teams".* FROM "teams" WHERE "teams"."teamID" = $1  [["teamID", 1]]
---
  def set_match
    @match = Match.includes(:tournament, :team1, :team2, :winning_team, :referee, :venue, :pom_player).find(params[:id])