CricDummy/app/controllers/players_controller.rb

  def index
    @players = Player.includes(:team).all
---
SELECT "players".* FROM "players"
SELECT "teams".* FROM "teams" WHERE "teams"."teamID" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11)  [["teamID", 1], ["teamID", 2], ["teamID", 3], ["teamID", 4], ["teamID", 5], ["teamID", 6], ["teamID", 7], ["teamID", 8], ["teamID", 9], ["teamID", 10], ["teamID", 11]]

  def update
    if @player.update(player_params)
---
UPDATE "players" SET "runsScored" = $1, "updated_at" = $2 WHERE "players"."playerID" = $3  [["runsScored", 226], ["updated_at", "2023-11-07 12:13:58.460829"], ["playerID", 5]]

  def create
    @player = Player.new(player_params)

    if @player.save
---
INSERT INTO "players" ("playerName", "dateOfBirth", "country", "teamID", "jerseyNO", "runsScored", "wicketsTaken", "matchesPlayed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "playerID"

  def destroy
    @player.destroy
---
DELETE FROM "players" WHERE "players"."playerID" = $1  [["playerID", 36]]

  def set_player
    @player = Player.includes(:team).find(params[:id])
---
SELECT "players".* FROM "players" WHERE "players"."playerID" = $1 LIMIT $2  [["playerID", 4], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."teamID" = $1  [["teamID", 1]]