CricDummy/app/controllers/referees_controller.rb

  def index
    @referees = Referee.all
---
SELECT "referees".* FROM "referees"

  def create
    @referee = Referee.new(referee_params)

    if @referee.save
---
INSERT INTO "referees" ("refereeName", "dateOfBirth", "nationality", "matchesOfficiated", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "refereeID"

  def set_referee
    @referee = Referee.find(params[:id])
---
SELECT "referees".* FROM "referees" WHERE "referees"."refereeID" = $1 LIMIT $2  [["refereeID", 5], ["LIMIT", 1]]