CricDummy/app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
  def index
    @teams = Team.all

INSERT INTO "teams" ("players", "teamName", "captain", "coach", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "teamID"
---
  def create
    @team = Team.new(team_params)
    if @team.save

UPDATE "teams" SET "players" = $1, "updated_at" = $2 WHERE "teams"."teamID" = $3  [["players", 14], ["updated_at", "2023-11-07 12:12:48.014452"], ["teamID", 4]]
---
  def update
    if @team.update(team_params)

SELECT "teams".* FROM "teams" WHERE "teams"."teamID" = $1 LIMIT $2  [["teamID", 2], ["LIMIT", 1]]
---
  def set_team
    @team = Team.find(params[:id])