CricDummy/app/controllers/tournaments_controller.rb

SELECT "formats".* FROM "formats" WHERE "formats"."formatID" IN ($1, $2, $3)  [["formatID", 3], ["formatID", 1], ["formatID", 2]]
SELECT "tournaments".* FROM "tournaments"
---
  def index
    @tournaments = Tournament.includes(:format).all

INSERT INTO "tournaments" ("tourName", "start_date", "end_date", "location", "tour_type", "prize", "formatID", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "tourID"
---
  def create
    @tournament = Tournament.new(tournament_params)

    if @tournament.save

UPDATE "tournaments" SET "formatID" = $1, "updated_at" = $2 WHERE "tournaments"."tourID" = $3  [["formatID", 3], ["updated_at", "2023-11-06 11:05:57.502731"], ["tourID", 1]]
---
  def update
    if @tournament.update(tournament_params)

SELECT "formats".* FROM "formats" WHERE "formats"."formatID" = $1  [["formatID", 3]]
SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."tourID" = $1 LIMIT $2  [["tourID", 2], ["LIMIT", 1]]
---
  def set_tournament
    @tournament = Tournament.includes(:format).find(params[:id])