CricDummy/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "firstName", "lastName", "dateOfBirth", "gender", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "userID"
INSERT INTO "logins" ("userID", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "loginID"  [["userID", 4], ["password", "[FILTERED]"], ["created_at", "2023-11-07 09:38:59.585847"], ["updated_at", "2023-11-07 09:38:59.585847"]]
---
  def create
    @user = User.new(user_params)

    if @user.save
      login = Login.new(userID: @user.userID, password: params[:password])
      if login.save

SELECT "users".* FROM "users" WHERE "users"."userID" = $1 LIMIT $2  [["userID", 1], ["LIMIT", 1]]
---
  def set_user
    @user = User.find(params[:id])