CricDummy/app/controllers/venues_controller.rb

  def index
    @venues = Venue.all
---
SELECT "venues".* FROM "venues"

  def create
    @venue = Venue.new(venue_params)

    if @venue.save
---
INSERT INTO "venues" ("venueName", "venueCity", "venueCountry", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "venueID"  [["venueName", "Wankhede Stadium"], ["venueCity", "Mumbai"], ["venueCountry", "India"], ["created_at", "2023-11-06 11:15:13.563238"], ["updated_at", "2023-11-06 11:15:13.563238"]]

  def set_venue
    @venue = Venue.find(params[:id])
---
SELECT "venues".* FROM "venues" WHERE "venues"."venueID" = $1 LIMIT $2  [["venueID", 6], ["LIMIT", 1]]